[{"title":"What exactly is deep learning and why should we be hyped?","permalink":"http://sdhnshu.com/deep-hype.html","link":"http://sdhnshu.com/deep-hype.html","date":"2017-03-19T00:00:00+05:30","modified":"2017-09-10T21:18:56+05:30","author":{"name":"Sudhanshu Passi","url":"http://sdhnshu.com/","email":"sudhanshupassi@gmail.com"},"content":"<p>Like most of you reading this article, I am a newbie to deep learning too. With a basic computer science degree, I entered this arena after I saw so much excitement among the people in this community. And once I knew what it was, I got hooked too.</p>\n\n<p>After Google open-sourced their machine learning library <a href=\"https://www.youtube.com/watch?v=oZikw5k_2FM\">Tensorflow</a>, there has been a lot of talk about ‘deep learning’ and for those who are <em>not</em> from a technical background, you may wonder what exactly all the hype is about. So without further ado, let’s get into it.</p>\n\n<p>Deep learning is a <em>computer algorithm</em> inspired by the structure of our brains, and neurologists think there’s something similar but a lot more complicated in our brains that help us humans do so complicated things.</p>\n\n<hr />\n\n<h1 id=\"a-brief-history\">A brief history</h1>\n\n<p>The algorithms for neural networks were <a href=\"https://www.google.co.in/search?q=Frank+Rosenblatt\">invented in the 60’s</a>, but it’s only now that we have enough computation power to carry it out on a large-scale. And our brain has around 1 billion neurons, so we still need a lot of computating power to reach that stage.</p>\n\n<p>Some important people who have worked in this field are <a href=\"https://www.google.co.in/search?q=Geoffrey+Hinton\">Geoffrey Hinton</a>, <a href=\"https://www.quora.com/profile/Yoshua-Bengio\">Yoshua Bengio</a>, <a href=\"https://medium.com/@karpathy\">Andrej Karpathy</a>, <a href=\"https://www.google.co.in/search?q=Yann+Le+Cunn\">Yann Le Cunn</a>, <a href=\"http://www.andrewng.org/\">Andrew Ng</a>, <a href=\"https://www.google.co.in/search?q=sebastian+thrun\">Sebastian Thrun</a>, <a href=\"https://www.quora.com/profile/Ian-Goodfellow#\">Ian Goodfellow</a>. Be sure to check them out if interested.</p>\n\n<hr />\n\n<h1 id=\"so-how-does-it-work\">So how does it work?</h1>\n\n<p>Traditional programming algorithms make us specify every case that can fall upon it. It breaks if an unspecified case occurs. The deep learning algorithm, however, looks at a lot of inputs and their corresponding outputs and tries to learn a pattern between them. Thus, after this <em>training</em> it will be able to predict an output when an unknown input is given. A fun visualization is <a href=\"http://playground.tensorflow.org/\">here</a>.</p>\n\n<p>Underneath, there’s a lot of <a href=\"https://www.youtube.com/watch?v=bxe2T-V8XRs&amp;list=PLiaHhY2iBX9hdHaRr6b7XevZtgZRa1PoU\">matrix multiplications, calculus and statistics.</a> Deep learning is actually an intersection of computer science, data science, neuroscience, and math. We write code that learns by itself and doesn’t need all cases specifically written.</p>\n\n<hr />\n\n<h1 id=\"so-does-it-have-neurons-like-our-brains-have\">So does it have neurons like our brains have?</h1>\n\n<p>Yes they do!</p>\n\n<p><img src=\"assets/img/perceptron.jpg\" alt=\"Perceptron\" class=\"size-small\" /></p>\n\n<p>Each circle in this picture is a neuron and there are connections between them. The yellows are inputs and orange is output. Depending on the signal strength of the inputs, the output is decided.</p>\n\n<p>Stack some of them together and you get neural networks that can do different things:</p>\n\n<p><img src=\"assets/img/dff.jpg\" alt=\"Feed forward\" />\n<img src=\"assets/img/rnn.jpg\" alt=\"RNNs\" />\n<img src=\"assets/img/cnn.jpg\" alt=\"CNNs\" />\n<img src=\"assets/img/gan.jpg\" alt=\"GANs\" /></p>\n\n<p><em>Picture credits: Fjodor van Veen — asimovinstitute.org</em></p>\n\n<hr />\n\n<h1 id=\"who-should-be-hyped\">Who should be hyped?</h1>\n\n<p>Everyone. Artificial neural networks have broken all records in image recognition and excels in a lot of other fields. Let me give you some examples:</p>\n\n<blockquote>\n  <p>A recurrent neural network defeated the world champion for the 5th time in the hardest game in the world, <a href=\"https://www.youtube.com/watch?v=TnUYcTuZJpM&amp;feature=youtu.be&amp;t=28s\">Go</a>, in March 2016</p>\n</blockquote>\n\n<blockquote>\n  <p>Nvidia, Tesla and Google are using convolutional networks for their <a href=\"https://www.youtube.com/watch?v=qhUvQiKec2U\">self driving cars</a></p>\n</blockquote>\n\n<blockquote>\n  <p>Google, Netflix, Amazon, and Facebook use neural networks for recommending what movie or product you would like, or whom you would like</p>\n</blockquote>\n\n<blockquote>\n  <p>Banks use neural networks for <a href=\"https://youtu.be/vOppzHpvTiQ?t=1m33s\">fraud detection</a></p>\n</blockquote>\n\n<blockquote>\n  <p>It is the state of the art in voice to text conversion, handwriting recognition and natural language processing</p>\n</blockquote>\n\n<blockquote>\n  <p>Art generation app <a href=\"http://prisma-ai.com/\">Prisma</a> uses convolutional neural networks</p>\n</blockquote>\n\n<blockquote>\n  <p>Researchers are using it for <a href=\"https://youtu.be/BmkA1ZsG2P4?t=6m39s\">drug discovery</a> and for <a href=\"https://www.youtube.com/watch?v=iOWamCtnwTc\">simulating physics</a></p>\n</blockquote>\n\n<p>According to the godfather of deep learning, <a href=\"https://www.youtube.com/watch?v=XG-dwZMc7Ng\">Geoffrey Hinton</a>, deep learning is going to disrupt a lot of fields in the coming 5 yrs and we can already see it.</p>\n\n<hr />\n\n<h1 id=\"theres-also-another-perspective-to-it\">There’s also another perspective to it</h1>\n\n<p>Some people may feel this is not a good thing as this may put us in a situation where machines might overpower us, but a lot of it is very far away and that’s why organizations like <a href=\"https://www.youtube.com/watch?v=AbcRlDBnwjM\">OpenAI, funded by Elon Musk</a> were found that aim to democratize artificial intelligence.</p>\n\n<p>It’s true that artificial intelligence will soon replace our menial jobs and it can’t be stopped. We won’t be driving our vehicles in some years, perhaps we might be able to solve the energy crisis using artificial neural networks.</p>\n\n<p>In the end, a knife can be used for good as well as for bad. Think before you do something, because the possibilities with a synthetic brain are endless. We have again reached a moment in history where we transcend ourselves and take humanity forward. It’s our responsibility to use it wisely.</p>","excerpt":"Explaining the importance of deep learning","languages":null,"categories":[],"tags":["blog-post"]}]